<?php

use Illuminate\Database\Migrations\Migration;
use Illuminate\Database\Schema\Blueprint;
use Illuminate\Support\Facades\Schema;
use Illuminate\Support\Facades\DB;

class CreateDistributorTable extends Migration
{
    /**
     * Run the migrations.
     *
     * @return void
     */
    public function up()
    {
        Schema::create('distributors', function (Blueprint $table) {
            $table->id();
            $table->string('name', '255');
            $table->string('phone', '20');
            $table->string('address', '255');
            $table->string('location', '20');
            $table->timestamps();
        });

        Schema::create('distribution_locations', function (Blueprint $table) {
            $table->id();
            $table->string('code', '20')->unique();
            $table->string('name', '20');
            $table->timestamps();
        });


        DB::statement("INSERT INTO `distribution_locations` (`id`, `code`, `name`, `created_at`, `updated_at`) VALUES
(1, 'angiang', 'An Giang', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(2, 'bariavungtau', 'Bà Rịa - Vũng Tàu', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(3, 'bacgiang', 'Bắc Giang', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(4, 'backan', 'Bắc Kạn', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(5, 'baclieu', 'Bạc Liêu', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(6, 'bacninh', 'Bắc Ninh', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(7, 'bentre', 'Bến Tre', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(8, 'binhduong', 'Bình Dương', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(9, 'binhdinh', 'Bình Định', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(10, 'binhphuoc', 'Bình Phước', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(11, 'binhthuan', 'Bình Thuận', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(12, 'camau', 'Cà Mau', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(13, 'cantho', 'Cần Thơ', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(14, 'caobang', 'Cao Bằng', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(15, 'danang', 'Đà Nẵng', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(16, 'daklak', 'Đắk Lắk', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(17, 'daknong', 'Đắk Nông', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(18, 'dienbien', 'Điện Biên', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(19, 'dongnai', 'Đồng Nai', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(20, 'dongthap', 'Đồng Tháp', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(21, 'gialai', 'Gia Lai', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(22, 'hagiang', 'Hà Giang', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(23, 'hanam', 'Hà Nam', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(24, 'hanoi', 'Hà Nội', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(25, 'hatinh', 'Hà Tĩnh', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(26, 'haiduong', 'Hải Dương', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(27, 'haiphong', 'Hải Phòng', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(28, 'haugiang', 'Hậu Giang', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(29, 'hoabinh', 'Hòa Bình', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(30, 'hungyen', 'Hưng Yên', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(31, 'khanhhoa', 'Khánh Hòa', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(32, 'kiengiang', 'Kiên Giang', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(33, 'kontum', 'Kon Tum', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(34, 'laichau', 'Lai Châu', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(35, 'lamdong', 'Lâm Đồng', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(36, 'langson', 'Lạng Sơn', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(37, 'laocai', 'Lào Cai', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(38, 'longan', 'Long An', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(39, 'namdinh', 'Nam Định', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(40, 'nghean', 'Nghệ An', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(41, 'ninhbinh', 'Ninh Bình', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(42, 'ninhthuan', 'Ninh Thuận', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(43, 'phutho', 'Phú Thọ', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(44, 'phuyen', 'Phú Yên', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(45, 'quangbinh', 'Quảng Bình', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(46, 'quangnam', 'Quảng Nam', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(47, 'quangngai', 'Quảng Ngãi', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(48, 'quangninh', 'Quảng Ninh', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(49, 'quangtri', 'Quảng Trị', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(50, 'soctrang', 'Sóc Trăng', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(51, 'sonla', 'Sơn La', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(52, 'tayninh', 'Tây Ninh', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(53, 'thaibinh', 'Thái Bình', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(54, 'thainguyen', 'Thái Nguyên', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(55, 'thanhhoa', 'Thanh Hóa', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(56, 'thuathienhue', 'Thừa Thiên Huế', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(57, 'tiengiang', 'Tiền Giang', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(58, 'tphcm', 'TP HCM', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(59, 'travinh', 'Trà Vinh', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(60, 'tuyenquang', 'Tuyên Quang', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(61, 'vinhlong', 'Vĩnh Long', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(62, 'vinhphuc', 'Vĩnh Phúc', '2020-08-20 10:27:25', '2020-08-20 10:27:25'),
(63, 'yenbai', 'Yên Bái', '2020-08-20 10:27:25', '2020-08-20 10:27:25');
");
    }

    /**
     * Reverse the migrations.
     *
     * @return void
     */
    public function down()
    {
        Schema::dropIfExists('distributors');
        Schema::dropIfExists('distribution_locations');
    }
}
